Repository: thesusian/rateyildiz.com
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: tr

source: Page Not Found
tr: Sayfa Bulunamadı

source: The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.
tr: Aradığınız sayfa kaldırılmış, adı değiştirilmiş veya geçici olarak kullanılamıyor olabilir.

source: Go to Homepage
tr: Ana Sayfaya Git

source: Server Error
tr: Sunucu Hatası

source: Internal Server Error
tr: Dahili Sunucu Hatası

source: Something went wrong on our end. Please try again later.
tr: Bizim tarafımızda bir şeyler yanlış gitti. Lütfen daha sonra tekrar deneyiniz.

source: Account
tr: Hesap

source: Account Information
tr: Hesap Bilgileri

source: Email
tr: E-posta

source: Account Type
tr: Hesap Türü

source: Admin
tr: Yönetici

source: Status
tr: Durum

source: Verified
tr: Doğrulandı

source: Student Email
tr: Öğrenci E-postası

source: Not Verified
tr: Doğrulanmadı

source: Verify Student Email
tr: Öğrenci E-postasını Doğrula

source: Logout
tr: Çıkış Yap

source: Please log in to view your account information.
tr: Hesap bilgilerinizi görüntülemek için lütfen giriş yapın.

source: Rate Yildiz
tr: Yıldız'ı Değerlendir

source: Toggle navigation
tr: Navigasyonu Aç/Kapat

source: Leaderboard
tr: Sıralama

source: Teachers
tr: Öğretmenler

source: Faculties
tr: Fakülteler

source: Login
tr: Giriş Yap

source: UK Flag
tr: İngiliz Bayrağı

source: English
tr: İngilizce

source: Turkish Flag
tr: Türk Bayrağı

source: no rights reserved, feel free to copy anything
tr: tüm hakları serbesttir, istediğinizi kopyalayabilirsiniz

source: Contact
tr: İletişim

source: contribute
tr: katkıda bulun

source: View Teachers
tr: Öğretmenleri Görüntüle

source: All Faculties
tr: Tüm Fakülteler

source: Rank
tr: Sıralama

source: Professor
tr: Profesör

source: Friendliness
tr: Arkadaşlık

source: Knowledge
tr: Bilgi

source: Total
tr: Toplam

source: Faculty Professors
tr: Fakülte Profesörleri

source: Faculty Leaderboard
tr: Fakülte Sıralaması

source: Search all teachers...
tr: Tüm öğretmenleri ara...

source: Search
tr: Ara

source: View Details / Rate
tr: Detayları Görüntüle / Değerlendir

source: No teachers found in this faculty.
tr: Bu fakültede öğretmen bulunamadı.

source: Home
tr: Ana Sayfa

source: Rate YTU
tr: YTÜ'yü Değerlendir

source: A little website for rating teachers in YTU, don't take it seriously
tr: YTÜ'deki öğretmenleri değerlendirmek için küçük bir website, çok ciddiye almayın

source: View All Teachers
tr: Tüm Öğretmenleri Görüntüle

source: View By Faculty
tr: Fakülteye Göre Görüntüle

source: Search teachers...
tr: Öğretmen ara...

source: Top Rated Teachers
tr: En Çok Değerlendirilen Öğretmenler

source: No teachers rated yet.
tr: Henüz değerlendirilmiş öğretmen yok.

source: View Full Leaderboard
tr: Tam Sıralamayı Görüntüle

source: Recent Reviews
tr: Son Değerlendirmeler

source: Anonymous
tr: Anonim

source: For Professor:
tr: Profesör için:

source: No recent reviews available.
tr: Yakın zamanda yapılmış değerlendirme yok.

source: About Rate Yildiz
tr: Rate Yildiz Hakkında

source: This a small website to rate teachers at Yildiz Technical Univerity. Why? for fun. You can translate the website to Turkish from the menu above.
tr: Bu, Yıldız Teknik Üniversitesi'ndeki öğretmenleri değerlendirmek için küçük bir website. Neden? Eğlence için. Websiteyi yukarıdaki menüden Türkçe'ye çevirebilirsiniz.

source: By logging in, you can rate professors without commenting. To be able to comment, you have to verify your account using your student email ending with (std.yildiz.edu.tr) you can do that
tr: Giriş yaparak, yorum yapmadan profesörleri değerlendirebilirsiniz. Yorum yapabilmek için, hesabınızı (std.yildiz.edu.tr) ile biten öğrenci mailiniz ile doğrulamanız gerekiyor, bunu

source: on the Account page.
tr: Hesap sayfasından yapabilirsiniz.

source: And a final note, please don't make any mean comments, keep it wholesome :D
tr: Ve son bir not, lütfen kırıcı yorumlar yapmayın, olumlu tutun :D

source: If you want to edit something or contribute to the site you can check out the
tr: Bir şey düzenlemek veya siteye katkıda bulunmak istiyorsanız bakabilirsiniz

source: project on Github
tr: Github'daki proje

source: it's opensource
tr: açık kaynak kodlu

source: Professor Leaderboard
tr: Profesör Sıralaması

source: Teacher
tr: Öğretmen

source: Overall Rating
tr: Genel Değerlendirme

source: Rate this Teacher
tr: Bu Öğretmeni Değerlendir

source: English Proficiency
tr: İngilizce Yeterliliği

source: Comment
tr: Yorum

source: You must be a verified user to leave a comment.
tr: Yorum yapabilmek için doğrulanmış kullanıcı olmanız gerekmektedir.

source: Verify your account
tr: Hesabınızı doğrulayın

source: Submit Rating
tr: Değerlendirmeyi Gönder

source: Please
tr: Lütfen

source: login
tr: giriş yapın

source: to rate this teacher
tr: bu öğretmeni değerlendirmek için

source: Reviews
tr: Değerlendirmeler

source: Verified Student
tr: Doğrulanmış Öğrenci

source: Verify Account
tr: Hesabı Doğrula

source: Unverified
tr: Doğrulanmamış

source: Rated on
tr: Değerlendirilme tarihi

source: Are you sure you want to delete your rating?
tr: Değerlendirmenizi silmek istediğinizden emin misiniz?

source: Delete
tr: Sil

source: No teachers found.
tr: Öğretmen bulunamadı.

source: Verify Your Student Email
tr: Öğrenci E-postanızı Doğrulayın

source: Yildiz Student Email
tr: Yıldız Öğrenci E-postası

source: Send Verification Code
tr: Doğrulama Kodu Gönder

source: Verification Code
tr: Doğrulama Kodu

source: Verify Code
tr: Kodu Doğrula

source: Your student email
tr: Öğrenci e-postanız

source: has been verified
tr: doğrulandı

source: Please log in to verify your student email
tr: Öğrenci e-postanızı doğrulamak için lütfen giriş yapın
